// 动态规划

// 斐波那契数，通常用 F(n) 表示，形成的序列称为 斐波那契数列 。该数列由 0 和 1 开始，后面的每一项数字都是前面两项数字的和。
// F(0) = 0，F(1) = 1        F(n) = F(n - 1) + F(n - 2)
// 输入：2       输出：1      解释：F(2) = F(1) + F(0) = 1 + 0 = 1
// 输入：3       输出：2      解释：F(3) = F(2) + F(1) = 1 + 1 = 2

/**
 * @param {number} n
 * @return {number}
 */
var fib = function (n) {
    // dp 数组的含义：第 i 个数的 斐波那契数 的值是 dp[i]
    // 初始值  dp[0] = 0; dp[1] = 1;
    let dp = [0, 1];
    // 递推
    for (let i = 2; i <= n; i++) {
        dp[i] = dp[i - 1] + dp[i - 2];
    }
    return dp[n];
};
